<?php

/*
 * Keyman is copyright (C) SIL Global. MIT License.
 *
 * Default English strings for keyboards/keyboard-details.php
 * When exporting strings from crowdin, convert \\$s to \$s
 */

declare(strict_types=1);

return [
  # Page Title
  "details_page_title" => "%1\$s ក្តារចុច",

  # Placeholder for new keyboard search
  "new_keyboard_search" => "ស្វែងរកក្ដារចុចថ្មី",
  
  # Search Button Value
  "search" => "ស្វែងរក",
  
  # Keyman Developer clone keyboard box
  
  # Fill in New Project Details box below and click OK to clone {filename}
  "new_project_details" =>
    "សូមបំពេញប្រអប់ព័ត៌មានលម្អិតនៃគម្រោងថ្មីខាងក្រោម រួចចុច OK ដើម្បីក្លូន %1​\$s ។",
  
  # "Install keyboard" button text
  "install_keyboard" => "ដំឡើងក្ដារចុច",
  
  # "Install keyboard" button description
  "install_keyboard_button_description" =>
    "ដំឡើង %1\$s សម្រាប់ %2\$s នៅលើឧបករណ៍នេះ",
  
  # keyboard download is not supported on this device
  "keyboard_not_supported" => 
    "ក្តារចុច​នេះ​មិន​អាចប្រើសម្រាប់​ឧបករណ៍​នេះ​ទេ។ អ្នក​អាច​រក​ជម្រើស​ផ្សេង​ទៀត​នៅ​ខាង​ក្រោម។",
  
  # Try this keyboard heading
  "try_this_keyboard" => "សាកល្បងក្ដារចុចនេះ",
  
  # "Use keyboard online" button text
  "use_keyboard_online" => "ប្រើប្រាស់ក្ដារចុចអនឡាញ",
  
  # "Full online editor" button text
  "full_online_editor" => "កម្មវិធីដំណើរការទាំងស្រុងអនឡាញ",
  
  # "Use keyboard online" button description
  "use_keyboard_button_description" => 
    "ប្រើ %1\$s នៅ​ក្នុង​កម្មវិធី​រុករកគេហទំព័រ​របស់​អ្នក ។ មិន​ចាំបាច់​ដំឡើង​អ្វី​ឡើយ ។",
  
  # Scan this QR code
  "scan_qr_code" => 
    "ស្កេនកូដ​នេះដើម្បី​ផ្ទុក​ក្ដារចុចនេះ​នៅ​លើ​ឧបករណ៍​ផ្សេង",
  
  # Headers in Keyboard Details section
  
  "keyboard_details" => "ព័ត៌មានលម្អិតអំពីក្តារចុច",
  
  "keyboard_ID" => "លេខសម្គាល់​ក្ដារចុច",
  
  "supported_platforms" => "ប្រព័ន្ធប្រតិបត្តិការដែលគាំទ្រ",
  
  "author" => "អ្នកបង្កើត",
  
  "license" => "អាជ្ញា​បណ្ណ​",
  
  "documentation" => "ឯកសារ",
  
  "keyboard_help" => "ជំនួយ​សម្រាប់​ក្ដារចុច",
  
  "help_not_available" => "មិនមានជំនួយ។",
  
  "source" => "ប្រភព",
  
  "source_not_available" => "មិនមានប្រភព។",
  
  "keyboard_version" => "ជំនាន់ក្ដារចុច",
  
  "last_updated" => "អាប់ដេតចុងក្រោយ",
  
  "package_download" => "ទាញយកកញ្ចប់",
  
  "monthly_downloads" => "ចំនួនទាញយកប្រចាំខែ",
  
  "total_downloads" => "ចំនួនទាញយកសរុប",
  
  # Total Downloads title - Downloads since {date}
  "downloads_since" => "ដំឡើងចាប់តាំងពី %1\$s",
  
  # Date to start counting downloads
  "date_counting" => "តុលា​ ២០១៩",

  "encoding" => "ការអ៊ីនកូដ",
  
  # Encoding list
  "encoding_list" => "យូនីកូដ, លេហ្កាស៊ី (អេអ៊ីនអេសអាយ)",
  
  # Unicode encoding
  "unicode" => "យូនីកូដ",
  
  # Legacy (ANSI) encoding
  "legacy_ansi" => "លេហ្កាស៊ី (អេអ៊ីនអេសអាយ)",
  
  # Minimum Keyman Version
  "minimum_version" => "ជំនាន់អប្បបរមានៃ %1\$s",
  
  "related_keyboards" => "ក្ដារចុចពាក់ព័ន្ធ",
  
  # This keyboard is not available on keyman.com
  "keyboard_not_available" => "ក្ដារចុចនេះមិនមាននៅ %1\$s",
  
  "deprecated" => "(បោះបង់)",
  
  "new_version" => "(ជំនាន់ថ្មី)",
  
  "supported_languages" => "ភាសាដែលអាចប្រើប្រាស់បាន",
  
  # Expand {count} more >>
  "expand_more" => "ពង្រីក %1\$s បន្ថែម >>",
  
  # << Collapse
  "collapse" => "<< បង្រួម",
  
  "permanent_link_to_this_keyboard" => "តំណអចិន្ត្រៃយ៍ទៅកាន់ក្ដារចុចនេះ៖",
  
  ## Obsolete keyboard notes
  
  "important_note" => "កំណត់ចំណាំសំខាន់៖",
  
  "obsolete_version" => 
    "ក្តារចុចនេះគឺជាប្រភេទក្តារចុចដែលលែងប្រើទៀតហើយ។ លុះត្រាតែអ្នកមានករណីចាំបាច់, ចុចទីនេះដើម្បីដំឡើងជំនាន់ថ្មី, ឈ្មោះ",
  
  "instead" => ", វិញ។",
  
  "view_obsolete_details" => "មើលព័ត៌មាន​លម្អិតអំពីជំនាន់បោះបង់ចោលវិញ",
  
  "new_search" => "ការស្វែងរកថ្មី",
  
  ## TODO: Previous/Next pagination handled in search.js
  
  
  ## Errors
  
  # Failed to load keyboard package [ID]
  "failed_to_load_keyboard_package" => "បរាជ័យក្នុងការទាញយកកញ្ចប់​ក្ដារចុច %1\$s",
  
  # Error returned from api.keyman.com: {error string}
  "error_returned_from_api" => "បញ្ហាត្រលប់មកពី %1\$s: %2\$s",
  
  # Keyboard package [ID] not found)'Failed to load keyboard package ' . 
  "package_not_found" => "កញ្ចប់ក្ដារចុច %1\$s រកមិនឃើញ។",
  
  # Sorry, this keyboard requires Keyman {minimum version} or higher.
  "requires_keyman_minimum_version" => 
    "សូមទោស, ក្ដារចុចនេះតម្រូវការ Keyman %1\$s ឫខ្ពស់ជាងនេះ។"

];
