<?php

/*
 * Keyman is copyright (C) SIL Global. MIT License.
 *
 * Default English strings for keyboards/keyboard-share.php
 * When exporting strings from crowdin, convert \\$s to \$s
 */

declare(strict_types=1);

return [
  # Head options title
  "head_title" => "ចែក​រំលែកក្ដារចុច %1\$s",

  # Page title - Sharing {keyboard}
  "h1_sharing_keyboard" => "កំពុងចែក​រំលែកក្ដារចុច %1\$s",

  "line1" => "អ្នកប្រហែលជាបានមកដល់ទីនេះ តាមរយៈការស្កេនកូដ QR ឬបើកតំណ
   ដើម្បីចែករំលែកក្ដារចុចពីកម្មវិធី Keyman។",

  "line2" => "យើងខ្ញុំសូមទោស, ប៉ុន្ដែជាអកុសល, ក្ដារចុចដែលអ្នកចាប់អារម្មណ៍, ហៅថា ",

  "line3" => "បច្ចុប្បន្ននេះ មិនទាន់មានទិន្នន័យពីឃ្លាំងផ្ទុកក្ដារចុច Keyman នៅឡើយទេ។",

  "h2_how_to_get" => "តើអ្នកអាចយកក្ដារចុចនេះ",

  "how_to_get_1" => "ក្ដារចុចនេះត្រូវបានចែកចាយពីមនុស្សម្នាក់ទៅមនុស្សម្នាក់ ជាជាងតាមរយៈ
   ឃ្លាំងផ្ទុកក្ដារចុច Keyman, ដូច្នេះវិធីដែលល្អបំផុតក្នុងការចូលប្រើក្ដារចុច
   គឺតាមការសួរបុគ្គលដែលបានចែករំលែកតំណឫកូដ QR នេះដល់អ្នក។",

  "how_to_get_2" => "ប្រសិនបើអ្នកមិនអាចស្វែងរកបុគ្គលដែលបានចែករំលែកក្ដារចុចនេះដល់អ្នកទេ,
   សូមសាកសួរនៅ ",

  # link to the Keyman forum
  "keyman_forum" => "Keyman Community Forum",

  "how_to_get_3" => "សម្រាប់ជំនួយស្វែងរកក្ដារចុច ឫជម្រើសជំនួស។"


];
