<?php

/*
 * Keyman is copyright (C) SIL Global. MIT License.
 *
 * Default English strings for keyboards/index.php
 * When exporting strings from crowdin, convert \\$s to \$s
 */

declare(strict_types=1);

return [
  # Page Title
  "page_title" => "ការស្វែងរកក្តារចុច",

  # Page Description
  "page_description" => "ការស្វែងរកក្តារចុច Keyman",

  # Keyboard search bar
  "keyboard_search" => "ក្តារចុចដែលស្វែងរក៖",
  
  # Search bar placeholder
  "enter_language" => "វាយបញ្ចូលភាសា ឫក្ដារចុច",
  
  # Search Button Value
  "search" => "ស្វែងរក",
  
  # Link to start a new keyboard search
  "new_search" => "ការស្វែងរកថ្មី",
  
  # Search box instruction (Popular keyboards | All keyboards)
  "enter_name" => "វាយបញ្ចូលឈ្មោះរបស់ក្ដារចុច ឫភាសាដើម្បីស្វែងរកអំពី",
  
  # Search box link for popular keyboards
  "popular_keyboards" => "ក្ដារចុចពេញនិយម",
  
  # Search box link for all Keyman keyboards
  "all_keyboards" => "ក្ដារចុចទាំងអស់",
  
  # Search box hint: List header
  "hints" => "ពាក្យគន្លឹះ",
  
  # Search box hint: Description
  "searchbox_description" => 
    "លទ្ធផល​ស្វែងរក​តែងតែ​បង្ហាញ​ជា​បញ្ជី​ក្ដារចុច ។ វាស្វែងរកអំពីឈ្មោះ និងព័ត៌មានលម្អិតរបស់ក្ដារចុច, ឈ្មោះភាសា, ឈ្មោះប្រទេស, និង ឈ្មោះចារឹកនៃក្ដារចុច ។",

  # Search box hint (line 2):
  "searchbox_hint_2" => 
    "អ្នកអាចភ្ជាប់បុព្វបទទាំងនេះ %1\$s (ឈ្មោះក្ដារចុច) %2\$s (ឈ្មោះភាសា) %3\$s (អក្សរចារឹក, ប្រព័ន្ធសរសេរ) ឫ
    %4\$s (ឈ្មោះប្រទេស) ដើម្បីធ្វើឱ្យលទ្ធផលស្វែងរកកាន់តែច្បាស់លាស់។ ឧទាហរណ៍ %5\$s ស្វែងរក​នូវ​ក្ដារចុច​សម្រាប់​ភាសា​ទាំងឡាយ​ដែល​ត្រូវបាន​ប្រើប្រាស់​នៅក្នុង​ប្រទេស​ថៃ។",
  
  # Search box hint (line 3):
  "searchbox_hint_3" => 
    "ការប្រើបុព្វបទ %1\$s ក្នុងការស្វែងរកស្លាកភាសា BCP 47, ឧទាហរណ៍ %2\$s ស្វែងរកភាសា Tigrigna (អេត្យូពី)។",

];
